dpp/DPP-Practicals.org
#+PROPERTY: header-args :eval never-export
#+title: Dpp Practicals

* Practical 1 - Socket Programming
** TCP
*** Client
#+begin_src python :tangle skt_tcp_c.py
import socket

# Create TCP socket
client_socket = socket.socket(socket.AF_INET, socket.SOCK_STREAM)

host = '127.0.0.1'
port = 5000

client_socket.connect((host, port))
print("Connected to TCP Server")

while True:
    message = input("Client: ")
    client_socket.send(message.encode())

    response = client_socket.recv(1024).decode()
    print("Server:", response)

client_socket.close()
#+end_src

*** Server
#+begin_src python :tangle skt_tcp_s.py
import socket

# Create TCP socket
server_socket = socket.socket(socket.AF_INET, socket.SOCK_STREAM)

host = '127.0.0.1'
port = 5000

server_socket.bind((host, port))
server_socket.listen(5)

print("TCP Server waiting for connection...")

conn, addr = server_socket.accept()
print("Connected to:", addr)

while True:
    data = conn.recv(1024).decode()
    if not data:

        break
    print("Client:", data)

    response = input("Server: ")
    conn.send(response.encode())

conn.close()
server_socket.close()
#+end_src
** UDP
*** Client
#+begin_src python :tangle skt_udp_c.py
import socket

# Create UDP socket
client_socket = socket.socket(socket.AF_INET, socket.SOCK_DGRAM)

host = '127.0.0.1'
port = 6000

while True:
    message = input("Client: ")
    client_socket.sendto(message.encode(), (host, port))

    data, addr = client_socket.recvfrom(1024)
    print("Server:", data.decode())
#+end_src

*** Server
#+begin_src python :tangle skt_udp_s.py
import socket

# Create UDP socket
server_socket = socket.socket(socket.AF_INET, socket.SOCK_DGRAM)

host = '127.0.0.1'
port = 6000

server_socket.bind((host, port))
print("UDP Server ready...")

while True:
    data, addr = server_socket.recvfrom(1024)
    print("Client:", data.decode())

    response = input("Server: ")
    server_socket.sendto(response.encode(), addr)
#+end_src

* Practical 2 - RPC Implementation
** Client
#+begin_src python :tangle rpc_c.py
import xmlrpc.client

# Connect to RPC server
proxy = xmlrpc.client.ServerProxy("http://localhost:8000/")

# Call remote methods
print("Addition:", proxy.add(10, 5))
print("Subtraction:", proxy.subtract(10, 5))
print("Multiplication:", proxy.multiply(10, 5))
print("Division:", proxy.divide(10, 5))
#+end_src

** Server
#+begin_src python :tangle rpc_s.py
from xmlrpc.server import SimpleXMLRPCServer

# Create RPC server
server = SimpleXMLRPCServer(("localhost", 8000))
print("RPC Server is running on port 8000...")

# Define remote functions
def add(a, b):
    return a + b

def subtract(a, b):
    return a - b

def multiply(a, b):
    return a * b

def divide(a, b):
    if b == 0:
        return "Error: Division by zero"
    return a / b

# Register functions
server.register_function(add, "add")
server.register_function(subtract, "subtract")
server.register_function(multiply, "multiply")
server.register_function(divide, "divide")

# Run server
server.serve_forever()
#+end_src

