dpp/DPP-Practicals.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-05-20 Wed 01:37 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Dpp Practicals</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Dpp Practicals</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org195b476">1. Practical 1 - Socket Programming</a>
<ul>
<li><a href="#org49bbdae">1.1. TCP</a>
<ul>
<li><a href="#org2db4d28">1.1.1. Client</a></li>
<li><a href="#org4ae28a6">1.1.2. Server</a></li>
</ul>
</li>
<li><a href="#org1312b49">1.2. UDP</a>
<ul>
<li><a href="#org5c5895d">1.2.1. Client</a></li>
<li><a href="#orgeddbd25">1.2.2. Server</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org6986397">2. Practical 2 - RPC Implementation</a>
<ul>
<li><a href="#org2aa0ac9">2.1. Client</a></li>
<li><a href="#org7e04388">2.2. Server</a></li>
</ul>
</li>
<li><a href="#org57d987a">3. Practical 3 - Clock Synchronization</a></li>
<li><a href="#orgd2f8d52">4. Practical 4 - Leader Election Algorithm</a></li>
<li><a href="#org3fb627a">5. Practical 5 - Distributed Mutual Exclusion</a></li>
<li><a href="#orgfd88281">6. Practical 6 - Parallel Matrix Multplication</a></li>
<li><a href="#orgef9194b">7. Practical 7 - Parallel Merge Sort</a></li>
<li><a href="#org2d48bf6">8. Practical 8 - Load Balancing Simulation</a></li>
<li><a href="#orga04697a">9. Practical 9 - Fault Tolerance Mechanism</a></li>
<li><a href="#orgaf893b2">10. Practical 10 - MapReduce Word Count</a></li>
</ul>
</div>
</div>
<div id="outline-container-org195b476" class="outline-2">
<h2 id="org195b476"><span class="section-number-2">1.</span> Practical 1 - Socket Programming</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org49bbdae" class="outline-3">
<h3 id="org49bbdae"><span class="section-number-3">1.1.</span> TCP</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org2db4d28" class="outline-4">
<h4 id="org2db4d28"><span class="section-number-4">1.1.1.</span> Client</h4>
<div class="outline-text-4" id="text-1-1-1">
<div class="org-src-container">
<pre class="src src-python"><code><span class="org-keyword">import</span> socket

<span class="org-comment-delimiter"># </span><span class="org-comment">Create TCP socket
</span><span class="org-variable-name">client_socket</span> <span class="org-operator">=</span> socket.socket(socket.AF_INET, socket.SOCK_STREAM)

<span class="org-variable-name">host</span> <span class="org-operator">=</span> <span class="org-string">'127.0.0.1'</span>
<span class="org-variable-name">port</span> <span class="org-operator">=</span> 5000

client_socket.connect((host, port))
<span class="org-builtin">print</span>(<span class="org-string">"Connected to TCP Server"</span>)

<span class="org-keyword">while</span> <span class="org-constant">True</span>:
    <span class="org-variable-name">message</span> <span class="org-operator">=</span> <span class="org-builtin">input</span>(<span class="org-string">"Client: "</span>)
    client_socket.send(message.encode())

    <span class="org-variable-name">response</span> <span class="org-operator">=</span> client_socket.recv(1024).decode()
    <span class="org-builtin">print</span>(<span class="org-string">"Server:"</span>, response)

client_socket.close()
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org4ae28a6" class="outline-4">
<h4 id="org4ae28a6"><span class="section-number-4">1.1.2.</span> Server</h4>
<div class="outline-text-4" id="text-1-1-2">
<div class="org-src-container">
<pre class="src src-python"><code><span class="org-keyword">import</span> socket

<span class="org-comment-delimiter"># </span><span class="org-comment">Create TCP socket
</span><span class="org-variable-name">server_socket</span> <span class="org-operator">=</span> socket.socket(socket.AF_INET, socket.SOCK_STREAM)

<span class="org-variable-name">host</span> <span class="org-operator">=</span> <span class="org-string">'127.0.0.1'</span>
<span class="org-variable-name">port</span> <span class="org-operator">=</span> 5000

server_socket.bind((host, port))
server_socket.listen(5)

<span class="org-builtin">print</span>(<span class="org-string">"TCP Server waiting for connection..."</span>)

<span class="org-variable-name">conn</span>, <span class="org-variable-name">addr</span> <span class="org-operator">=</span> server_socket.accept()
<span class="org-builtin">print</span>(<span class="org-string">"Connected to:"</span>, addr)

<span class="org-keyword">while</span> <span class="org-constant">True</span>:
    <span class="org-variable-name">data</span> <span class="org-operator">=</span> conn.recv(1024).decode()
    <span class="org-keyword">if</span> <span class="org-keyword">not</span> data:

        <span class="org-keyword">break</span>
    <span class="org-builtin">print</span>(<span class="org-string">"Client:"</span>, data)

    <span class="org-variable-name">response</span> <span class="org-operator">=</span> <span class="org-builtin">input</span>(<span class="org-string">"Server: "</span>)
    conn.send(response.encode())

conn.close()
server_socket.close()
</code></pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org1312b49" class="outline-3">
<h3 id="org1312b49"><span class="section-number-3">1.2.</span> UDP</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org5c5895d" class="outline-4">
<h4 id="org5c5895d"><span class="section-number-4">1.2.1.</span> Client</h4>
<div class="outline-text-4" id="text-1-2-1">
<div class="org-src-container">
<pre class="src src-python"><code><span class="org-keyword">import</span> socket

<span class="org-comment-delimiter"># </span><span class="org-comment">Create UDP socket
</span><span class="org-variable-name">client_socket</span> <span class="org-operator">=</span> socket.socket(socket.AF_INET, socket.SOCK_DGRAM)

<span class="org-variable-name">host</span> <span class="org-operator">=</span> <span class="org-string">'127.0.0.1'</span>
<span class="org-variable-name">port</span> <span class="org-operator">=</span> 6000

<span class="org-keyword">while</span> <span class="org-constant">True</span>:
    <span class="org-variable-name">message</span> <span class="org-operator">=</span> <span class="org-builtin">input</span>(<span class="org-string">"Client: "</span>)
    client_socket.sendto(message.encode(), (host, port))

    <span class="org-variable-name">data</span>, <span class="org-variable-name">addr</span> <span class="org-operator">=</span> client_socket.recvfrom(1024)
    <span class="org-builtin">print</span>(<span class="org-string">"Server:"</span>, data.decode())
</code></pre>
</div>
</div>
</div>
<div id="outline-container-orgeddbd25" class="outline-4">
<h4 id="orgeddbd25"><span class="section-number-4">1.2.2.</span> Server</h4>
<div class="outline-text-4" id="text-1-2-2">
<div class="org-src-container">
<pre class="src src-python"><code><span class="org-keyword">import</span> socket

<span class="org-comment-delimiter"># </span><span class="org-comment">Create UDP socket
</span><span class="org-variable-name">server_socket</span> <span class="org-operator">=</span> socket.socket(socket.AF_INET, socket.SOCK_DGRAM)

<span class="org-variable-name">host</span> <span class="org-operator">=</span> <span class="org-string">'127.0.0.1'</span>
<span class="org-variable-name">port</span> <span class="org-operator">=</span> 6000

server_socket.bind((host, port))
<span class="org-builtin">print</span>(<span class="org-string">"UDP Server ready..."</span>)

<span class="org-keyword">while</span> <span class="org-constant">True</span>:
    <span class="org-variable-name">data</span>, <span class="org-variable-name">addr</span> <span class="org-operator">=</span> server_socket.recvfrom(1024)
    <span class="org-builtin">print</span>(<span class="org-string">"Client:"</span>, data.decode())

    <span class="org-variable-name">response</span> <span class="org-operator">=</span> <span class="org-builtin">input</span>(<span class="org-string">"Server: "</span>)
    server_socket.sendto(response.encode(), addr)
</code></pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-org6986397" class="outline-2">
<h2 id="org6986397"><span class="section-number-2">2.</span> Practical 2 - RPC Implementation</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org2aa0ac9" class="outline-3">
<h3 id="org2aa0ac9"><span class="section-number-3">2.1.</span> Client</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-python"><code><span class="org-keyword">import</span> xmlrpc.client

<span class="org-comment-delimiter"># </span><span class="org-comment">Connect to RPC server
</span><span class="org-variable-name">proxy</span> <span class="org-operator">=</span> xmlrpc.client.ServerProxy(<span class="org-string">"http://localhost:8000/"</span>)

<span class="org-comment-delimiter"># </span><span class="org-comment">Call remote methods
</span><span class="org-builtin">print</span>(<span class="org-string">"Addition:"</span>, proxy.add(10, 5))
<span class="org-builtin">print</span>(<span class="org-string">"Subtraction:"</span>, proxy.subtract(10, 5))
<span class="org-builtin">print</span>(<span class="org-string">"Multiplication:"</span>, proxy.multiply(10, 5))
<span class="org-builtin">print</span>(<span class="org-string">"Division:"</span>, proxy.divide(10, 5))
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org7e04388" class="outline-3">
<h3 id="org7e04388"><span class="section-number-3">2.2.</span> Server</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-python"><code><span class="org-keyword">from</span> xmlrpc.server <span class="org-keyword">import</span> SimpleXMLRPCServer

<span class="org-comment-delimiter"># </span><span class="org-comment">Create RPC server
</span><span class="org-variable-name">server</span> <span class="org-operator">=</span> SimpleXMLRPCServer((<span class="org-string">"localhost"</span>, 8000))
<span class="org-builtin">print</span>(<span class="org-string">"RPC Server is running on port 8000..."</span>)

<span class="org-comment-delimiter"># </span><span class="org-comment">Define remote functions
</span><span class="org-keyword">def</span> <span class="org-function-name">add</span>(a, b):
    <span class="org-keyword">return</span> a <span class="org-operator">+</span> b

<span class="org-keyword">def</span> <span class="org-function-name">subtract</span>(a, b):
    <span class="org-keyword">return</span> a <span class="org-operator">-</span> b

<span class="org-keyword">def</span> <span class="org-function-name">multiply</span>(a, b):
    <span class="org-keyword">return</span> a <span class="org-operator">*</span> b

<span class="org-keyword">def</span> <span class="org-function-name">divide</span>(a, b):
    <span class="org-keyword">if</span> b <span class="org-operator">==</span> 0:
        <span class="org-keyword">return</span> <span class="org-string">"Error: Division by zero"</span>
    <span class="org-keyword">return</span> a <span class="org-operator">/</span> b

<span class="org-comment-delimiter"># </span><span class="org-comment">Register functions
</span>server.register_function(add, <span class="org-string">"add"</span>)
server.register_function(subtract, <span class="org-string">"subtract"</span>)
server.register_function(multiply, <span class="org-string">"multiply"</span>)
server.register_function(divide, <span class="org-string">"divide"</span>)

<span class="org-comment-delimiter"># </span><span class="org-comment">Run server
</span>server.serve_forever()
</code></pre>
</div>
</div>
</div>
</div>
