dpp/DPP-Practicals.org
* Practical 3 - Clock Synchronization
#+begin_src python :tangle clksy.py
import time
import random


class TimeServer:
    def get_time(self):
        return time.time()


class Client:
    def __init__(self, offset):
        self.offset = offset

    def get_local_time(self):
        return time.time() + self.offset

    def sync(self, server):

        t1 = self.get_local_time()

        time.sleep(random.uniform(0.1, 0.5))

        server_time = server.get_time()

        time.sleep(random.uniform(0.1, 0.5))

        t2 = self.get_local_time()

        rtt = t2 - t1

        adjusted_time = server_time + (rtt / 2)

        self.offset = adjusted_time - time.time()
        print(f"new client time {self.get_local_time()}")


if __name__ == "__main__":
    server = TimeServer()
    client = Client(offset=-5)

    print(f"Server time {server.get_time()}")
    print(f"Initial time is {client.get_local_time()}")

    client.sync(server)
#+end_src

#+RESULTS:
: Initial Client Time: 1778922172.6111681
: Server Time: 1778922177.6111875
:
: --- Cristian’s Algorithm ---
: Client sends request at: 1778922172.6111968
: Client receives response at: 1778922173.3584142
: Estimated RTT: 0.7472174167633057
: Client clock synchronized!
: New Client Time: 1778922178.3584182

* Practical 4 - Leader Election Algorithm
#+begin_src python :tangle leader.py
processes = {1: 1, 2: 1, 3: 0, 4: 1, 5: 1}


def bully(initiator):
    active = [p for p in processes if p > initiator and processes[p]]

    if active:
        for p in active:
            print(f"{initiator} -> Election -> {p}")
        coord = max(p for p in active if processes[p])
    else:
        coord = initiator

    print(f"Coordinatior is {coord}")
    return coord


def ring(initiator):
    pids = list(processes.keys())
    i = pids.index(initiator)
    msg = []

    while True:
        pid = pids[i]
        if processes[pid]:
            print(f"{pid} passes message")
            msg.append(pid)

        i = (i + 1) % len(pids)
        if pids[i] == initiator:
            break

    print(f"Coordinator is {max(msg)}")
    return max(msg)


while True:
    print("\n1.Bully 2.Ring 3.Exit")
    ch = int(input("Choice: "))

    if ch == 3:
        break

    for p, s in processes.items():
        print(f"Process {p} is {'Active' if s else 'Down'}")

    init = int(input("Initiator: "))

    if ch == 1:
        bully(init)
    if ch == 2:
        ring(init)
#+end_src

#+RESULTS:
:
: LEADER ELECTION MENU
: 1. Bully Election Algorithm
: 2. Ring Election Algorithm
: 3. Exit
: Enter your choice:

