dpp/DPP-Practicals.html
<div id="outline-container-org57d987a" class="outline-2">
<h2 id="org57d987a"><span class="section-number-2">3.</span> Practical 3 - Clock Synchronization</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-python"><code><span class="org-keyword">import</span> time
<span class="org-keyword">import</span> random


<span class="org-keyword">class</span> <span class="org-type">TimeServer</span>:
    <span class="org-keyword">def</span> <span class="org-function-name">get_time</span>(<span class="org-keyword">self</span>):
        <span class="org-keyword">return</span> time.time()


<span class="org-keyword">class</span> <span class="org-type">Client</span>:
    <span class="org-keyword">def</span> <span class="org-function-name">__init__</span>(<span class="org-keyword">self</span>, offset):
        <span class="org-keyword">self</span>.<span class="org-variable-name">offset</span> <span class="org-operator">=</span> offset

    <span class="org-keyword">def</span> <span class="org-function-name">get_local_time</span>(<span class="org-keyword">self</span>):
        <span class="org-keyword">return</span> time.time() <span class="org-operator">+</span> <span class="org-keyword">self</span>.offset

    <span class="org-keyword">def</span> <span class="org-function-name">sync</span>(<span class="org-keyword">self</span>, server):

        <span class="org-variable-name">t1</span> <span class="org-operator">=</span> <span class="org-keyword">self</span>.get_local_time()

        time.sleep(random.uniform(0.1, 0.5))

        <span class="org-variable-name">server_time</span> <span class="org-operator">=</span> server.get_time()

        time.sleep(random.uniform(0.1, 0.5))

        <span class="org-variable-name">t2</span> <span class="org-operator">=</span> <span class="org-keyword">self</span>.get_local_time()

        <span class="org-variable-name">rtt</span> <span class="org-operator">=</span> t2 <span class="org-operator">-</span> t1

        <span class="org-variable-name">adjusted_time</span> <span class="org-operator">=</span> server_time <span class="org-operator">+</span> (rtt <span class="org-operator">/</span> 2)

        <span class="org-keyword">self</span>.<span class="org-variable-name">offset</span> <span class="org-operator">=</span> adjusted_time <span class="org-operator">-</span> time.time()
        <span class="org-builtin">print</span>(f<span class="org-string">"new client time </span>{<span class="org-keyword">self</span>.get_local_time()}<span class="org-string">"</span>)


<span class="org-keyword">if</span> <span class="org-builtin">__name__</span> <span class="org-operator">==</span> <span class="org-string">"__main__"</span>:
    <span class="org-variable-name">server</span> <span class="org-operator">=</span> TimeServer()
    <span class="org-variable-name">client</span> <span class="org-operator">=</span> Client(offset<span class="org-operator">=-</span>5)

    <span class="org-builtin">print</span>(f<span class="org-string">"Server time </span>{server.get_time()}<span class="org-string">"</span>)
    <span class="org-builtin">print</span>(f<span class="org-string">"Initial time is </span>{client.get_local_time()}<span class="org-string">"</span>)

    client.sync(server)
</code></pre>
</div>

<pre class="example">
Initial Client Time: 1778922172.6111681
Server Time: 1778922177.6111875

--- Cristian’s Algorithm ---
Client sends request at: 1778922172.6111968
Client receives response at: 1778922173.3584142
Estimated RTT: 0.7472174167633057
Client clock synchronized!
New Client Time: 1778922178.3584182
</pre>
</div>
</div>
<div id="outline-container-orgd2f8d52" class="outline-2">
<h2 id="orgd2f8d52"><span class="section-number-2">4.</span> Practical 4 - Leader Election Algorithm</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-python"><code><span class="org-variable-name">processes</span> <span class="org-operator">=</span> {1: 1, 2: 1, 3: 0, 4: 1, 5: 1}


<span class="org-keyword">def</span> <span class="org-function-name">bully</span>(initiator):
    <span class="org-variable-name">active</span> <span class="org-operator">=</span> [p <span class="org-keyword">for</span> p <span class="org-keyword">in</span> processes <span class="org-keyword">if</span> p <span class="org-operator">&gt;</span> initiator <span class="org-keyword">and</span> processes[p]]

    <span class="org-keyword">if</span> active:
        <span class="org-keyword">for</span> p <span class="org-keyword">in</span> active:
            <span class="org-builtin">print</span>(f<span class="org-string">"</span>{initiator}<span class="org-string"> -&gt; Election -&gt; </span>{p}<span class="org-string">"</span>)
        <span class="org-variable-name">coord</span> <span class="org-operator">=</span> <span class="org-builtin">max</span>(p <span class="org-keyword">for</span> p <span class="org-keyword">in</span> active <span class="org-keyword">if</span> processes[p])
    <span class="org-keyword">else</span>:
        <span class="org-variable-name">coord</span> <span class="org-operator">=</span> initiator

    <span class="org-builtin">print</span>(f<span class="org-string">"Coordinatior is </span>{coord}<span class="org-string">"</span>)
    <span class="org-keyword">return</span> coord


<span class="org-keyword">def</span> <span class="org-function-name">ring</span>(initiator):
    <span class="org-variable-name">pids</span> <span class="org-operator">=</span> <span class="org-builtin">list</span>(processes.keys())
    <span class="org-variable-name">i</span> <span class="org-operator">=</span> pids.index(initiator)
    <span class="org-variable-name">msg</span> <span class="org-operator">=</span> []

    <span class="org-keyword">while</span> <span class="org-constant">True</span>:
        <span class="org-variable-name">pid</span> <span class="org-operator">=</span> pids[i]
        <span class="org-keyword">if</span> processes[pid]:
            <span class="org-builtin">print</span>(f<span class="org-string">"</span>{pid}<span class="org-string"> passes message"</span>)
            msg.append(pid)

        <span class="org-variable-name">i</span> <span class="org-operator">=</span> (i <span class="org-operator">+</span> 1) <span class="org-operator">%</span> <span class="org-builtin">len</span>(pids)
        <span class="org-keyword">if</span> pids[i] <span class="org-operator">==</span> initiator:
            <span class="org-keyword">break</span>

    <span class="org-builtin">print</span>(f<span class="org-string">"Coordinator is </span>{<span class="org-builtin">max</span>(msg)}<span class="org-string">"</span>)
    <span class="org-keyword">return</span> <span class="org-builtin">max</span>(msg)


<span class="org-keyword">while</span> <span class="org-constant">True</span>:
    <span class="org-builtin">print</span>(<span class="org-string">"</span><span class="org-constant">\n</span><span class="org-string">1.Bully 2.Ring 3.Exit"</span>)
    <span class="org-variable-name">ch</span> <span class="org-operator">=</span> <span class="org-builtin">int</span>(<span class="org-builtin">input</span>(<span class="org-string">"Choice: "</span>))

    <span class="org-keyword">if</span> ch <span class="org-operator">==</span> 3:
        <span class="org-keyword">break</span>

    <span class="org-keyword">for</span> p, s <span class="org-keyword">in</span> processes.items():
        <span class="org-builtin">print</span>(f<span class="org-string">"Process </span>{p}<span class="org-string"> is </span>{'Active' <span class="org-keyword">if</span> s <span class="org-keyword">else</span> 'Down'}<span class="org-string">"</span>)

    <span class="org-variable-name">init</span> <span class="org-operator">=</span> <span class="org-builtin">int</span>(<span class="org-builtin">input</span>(<span class="org-string">"Initiator: "</span>))

    <span class="org-keyword">if</span> ch <span class="org-operator">==</span> 1:
        bully(init)
    <span class="org-keyword">if</span> ch <span class="org-operator">==</span> 2:
        ring(init)
</code></pre>
</div>

<pre class="example">

LEADER ELECTION MENU
1. Bully Election Algorithm
2. Ring Election Algorithm
3. Exit
Enter your choice:
</pre>
</div>
</div>
