dpp/DPP-Practicals.org
* Practical 5 - Distributed Mutual Exclusion
#+begin_src python :tangle mutial.py
# Lamport's Mutual Exclusion Algorithm (Simulation)
import heapq


class Process:
    def __init__(self, pid):
        self.pid = pid
        self.clock = 0
        self.q = []

    def request(self):
        self.clock += 1
        req = (self.clock, self.pid)
        heapq.heappush(self.q, req)
        print(f"Process {self.pid} requests for CS at {self.clock}")
        return req

    def recive_req(self, request):
        heapq.heappush(self.q, request)
        self.clock = max(self.clock, request[0]) + 1

    def can_enter(self):
        return self.q[0][1] == self.pid

    def release(self):
        heapq.heappop(self.q)
        print(f"Process {self.pid} released from CS")


if __name__ == "__main__":
    p1 = Process(1)
    p2 = Process(2)
    p3 = Process(3)

    req1 = p1.request()
    p2.recive_req(req1)
    p3.recive_req(req1)

    req2 = p2.request()
    p1.recive_req(req2)
    p3.recive_req(req2)

    if p1.can_enter():
        print("P1 enters CS")
        p1.release()

    if p2.can_enter():
        print("P1 enters CS")
        p2.release()
#+end_src

#+RESULTS:
: Process 1 requests CS at time 1
: Process 2 requests CS at time 3
: Process 1 enters Critical Section
: Process 1 releases CS

* Practical 6 - Parallel Matrix Multplication
#+begin_src python :tangle matrix.py
import multiprocessing, time

n = 3

a = [[i + j for j in range(n)] for i in range(n)]
b = [[i * j for j in range(n)] for i in range(n)]


def multiply(i):
    return [sum(a[i][k] * b[k][j] for k in range(n)) for j in range(n)]


def multiply(i):
    return [sum(a[i][k] * b[k][j] for k in range(n)) for j in range(n)]


if __name__ == "__main__":

    print("\nMatrix A")
    for row in a:
        print(row)

    print("\nMatrix B")
    for row in b:
        print(row)

    t1 = time.time()
    seq = [multiply(i) for i in range(n)]

    print("\nMatrix Result")
    for row in seq:
        print(row)

    print(f"Time taken by sequencial {time.time() - t1}")

    t2 = time.time()

    with multiprocessing.Pool() as p:
        result = p.map(multiply, range(n))

    print("\nMatrix Result")
    for row in result:
        print(row)

    print(f"Time taken by parallel {time.time() - t2}")
#+end_src

* Practical 7 - Parallel Merge Sort
#+begin_src python :tangle merge.py
from multiprocessing import Process, Queue


def merge(a, b):
    r = []
    while a and b:
        r.append(a.pop(0) if a[0] < b[0] else b.pop(0))
    return r + a + b


def sort(a):
    mid = len(a) // 2
    return a if len(a) <= 1 else merge(sort(a[:mid]), sort(a[mid:]))


def parallel_sort(a, q):
    q.put(sort(a))


if __name__ == "__main__":
    arr = [8, 3, 7, 4, 9, 2, 6, 5]
    mid = len(arr) // 2
    q1, q2 = Queue(), Queue()

    p1 = Process(target=parallel_sort, args=(arr[:mid], q1))
    p2 = Process(target=parallel_sort, args=(arr[mid:], q2))

    p1.start()
    p2.start()

    sorted_arr = merge(q1.get(), q2.get())

    p1.join()
    p2.join()

    print("Unsorted:", arr)
    print("Sorted:", sorted_arr)
#+end_src

