dpp/DPP-Practicals.html
<div id="outline-container-org3fb627a" class="outline-2">
<h2 id="org3fb627a"><span class="section-number-2">5.</span> Practical 5 - Distributed Mutual Exclusion</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">
<pre class="src src-python"><code><span class="org-comment-delimiter"># </span><span class="org-comment">Lamport's Mutual Exclusion Algorithm (Simulation)
</span><span class="org-keyword">import</span> heapq


<span class="org-keyword">class</span> <span class="org-type">Process</span>:
    <span class="org-keyword">def</span> <span class="org-function-name">__init__</span>(<span class="org-keyword">self</span>, pid):
        <span class="org-keyword">self</span>.<span class="org-variable-name">pid</span> <span class="org-operator">=</span> pid
        <span class="org-keyword">self</span>.<span class="org-variable-name">clock</span> <span class="org-operator">=</span> 0
        <span class="org-keyword">self</span>.<span class="org-variable-name">q</span> <span class="org-operator">=</span> []

    <span class="org-keyword">def</span> <span class="org-function-name">request</span>(<span class="org-keyword">self</span>):
        <span class="org-keyword">self</span>.<span class="org-variable-name">clock</span> <span class="org-operator">+=</span> 1
        <span class="org-variable-name">req</span> <span class="org-operator">=</span> (<span class="org-keyword">self</span>.clock, <span class="org-keyword">self</span>.pid)
        heapq.heappush(<span class="org-keyword">self</span>.q, req)
        <span class="org-builtin">print</span>(f<span class="org-string">"Process </span>{<span class="org-keyword">self</span>.pid}<span class="org-string"> requests for CS at </span>{<span class="org-keyword">self</span>.clock}<span class="org-string">"</span>)
        <span class="org-keyword">return</span> req

    <span class="org-keyword">def</span> <span class="org-function-name">recive_req</span>(<span class="org-keyword">self</span>, request):
        heapq.heappush(<span class="org-keyword">self</span>.q, request)
        <span class="org-keyword">self</span>.<span class="org-variable-name">clock</span> <span class="org-operator">=</span> <span class="org-builtin">max</span>(<span class="org-keyword">self</span>.clock, request[0]) <span class="org-operator">+</span> 1

    <span class="org-keyword">def</span> <span class="org-function-name">can_enter</span>(<span class="org-keyword">self</span>):
        <span class="org-keyword">return</span> <span class="org-keyword">self</span>.q[0][1] <span class="org-operator">==</span> <span class="org-keyword">self</span>.pid

    <span class="org-keyword">def</span> <span class="org-function-name">release</span>(<span class="org-keyword">self</span>):
        heapq.heappop(<span class="org-keyword">self</span>.q)
        <span class="org-builtin">print</span>(f<span class="org-string">"Process </span>{<span class="org-keyword">self</span>.pid}<span class="org-string"> released from CS"</span>)


<span class="org-keyword">if</span> <span class="org-builtin">__name__</span> <span class="org-operator">==</span> <span class="org-string">"__main__"</span>:
    <span class="org-variable-name">p1</span> <span class="org-operator">=</span> Process(1)
    <span class="org-variable-name">p2</span> <span class="org-operator">=</span> Process(2)
    <span class="org-variable-name">p3</span> <span class="org-operator">=</span> Process(3)

    <span class="org-variable-name">req1</span> <span class="org-operator">=</span> p1.request()
    p2.recive_req(req1)
    p3.recive_req(req1)

    <span class="org-variable-name">req2</span> <span class="org-operator">=</span> p2.request()
    p1.recive_req(req2)
    p3.recive_req(req2)

    <span class="org-keyword">if</span> p1.can_enter():
        <span class="org-builtin">print</span>(<span class="org-string">"P1 enters CS"</span>)
        p1.release()

    <span class="org-keyword">if</span> p2.can_enter():
        <span class="org-builtin">print</span>(<span class="org-string">"P1 enters CS"</span>)
        p2.release()
</code></pre>
</div>

<pre class="example">
Process 1 requests CS at time 1
Process 2 requests CS at time 3
Process 1 enters Critical Section
Process 1 releases CS
</pre>
</div>
</div>
<div id="outline-container-orgfd88281" class="outline-2">
<h2 id="orgfd88281"><span class="section-number-2">6.</span> Practical 6 - Parallel Matrix Multplication</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">
<pre class="src src-python"><code><span class="org-keyword">import</span> multiprocessing, time

<span class="org-variable-name">n</span> <span class="org-operator">=</span> 3

<span class="org-variable-name">a</span> <span class="org-operator">=</span> [[i <span class="org-operator">+</span> j <span class="org-keyword">for</span> j <span class="org-keyword">in</span> <span class="org-builtin">range</span>(n)] <span class="org-keyword">for</span> i <span class="org-keyword">in</span> <span class="org-builtin">range</span>(n)]
<span class="org-variable-name">b</span> <span class="org-operator">=</span> [[i <span class="org-operator">*</span> j <span class="org-keyword">for</span> j <span class="org-keyword">in</span> <span class="org-builtin">range</span>(n)] <span class="org-keyword">for</span> i <span class="org-keyword">in</span> <span class="org-builtin">range</span>(n)]


<span class="org-keyword">def</span> <span class="org-function-name">multiply</span>(i):
    <span class="org-keyword">return</span> [<span class="org-builtin">sum</span>(a[i][k] <span class="org-operator">*</span> b[k][j] <span class="org-keyword">for</span> k <span class="org-keyword">in</span> <span class="org-builtin">range</span>(n)) <span class="org-keyword">for</span> j <span class="org-keyword">in</span> <span class="org-builtin">range</span>(n)]


<span class="org-keyword">def</span> <span class="org-function-name">multiply</span>(i):
    <span class="org-keyword">return</span> [<span class="org-builtin">sum</span>(a[i][k] <span class="org-operator">*</span> b[k][j] <span class="org-keyword">for</span> k <span class="org-keyword">in</span> <span class="org-builtin">range</span>(n)) <span class="org-keyword">for</span> j <span class="org-keyword">in</span> <span class="org-builtin">range</span>(n)]


<span class="org-keyword">if</span> <span class="org-builtin">__name__</span> <span class="org-operator">==</span> <span class="org-string">"__main__"</span>:

    <span class="org-builtin">print</span>(<span class="org-string">"</span><span class="org-constant">\n</span><span class="org-string">Matrix A"</span>)
    <span class="org-keyword">for</span> row <span class="org-keyword">in</span> a:
        <span class="org-builtin">print</span>(row)

    <span class="org-builtin">print</span>(<span class="org-string">"</span><span class="org-constant">\n</span><span class="org-string">Matrix B"</span>)
    <span class="org-keyword">for</span> row <span class="org-keyword">in</span> b:
        <span class="org-builtin">print</span>(row)

    <span class="org-variable-name">t1</span> <span class="org-operator">=</span> time.time()
    <span class="org-variable-name">seq</span> <span class="org-operator">=</span> [multiply(i) <span class="org-keyword">for</span> i <span class="org-keyword">in</span> <span class="org-builtin">range</span>(n)]

    <span class="org-builtin">print</span>(<span class="org-string">"</span><span class="org-constant">\n</span><span class="org-string">Matrix Result"</span>)
    <span class="org-keyword">for</span> row <span class="org-keyword">in</span> seq:
        <span class="org-builtin">print</span>(row)

    <span class="org-builtin">print</span>(f<span class="org-string">"Time taken by sequencial </span>{time.time() <span class="org-operator">-</span> t1}<span class="org-string">"</span>)

    <span class="org-variable-name">t2</span> <span class="org-operator">=</span> time.time()

    <span class="org-keyword">with</span> multiprocessing.Pool() <span class="org-keyword">as</span> p:
        <span class="org-variable-name">result</span> <span class="org-operator">=</span> p.<span class="org-builtin">map</span>(multiply, <span class="org-builtin">range</span>(n))

    <span class="org-builtin">print</span>(<span class="org-string">"</span><span class="org-constant">\n</span><span class="org-string">Matrix Result"</span>)
    <span class="org-keyword">for</span> row <span class="org-keyword">in</span> result:
        <span class="org-builtin">print</span>(row)

    <span class="org-builtin">print</span>(f<span class="org-string">"Time taken by parallel </span>{time.time() <span class="org-operator">-</span> t2}<span class="org-string">"</span>)
</code></pre>
</div>
</div>
</div>
<div id="outline-container-orgef9194b" class="outline-2">
<h2 id="orgef9194b"><span class="section-number-2">7.</span> Practical 7 - Parallel Merge Sort</h2>
<div class="outline-text-2" id="text-7">
<div class="org-src-container">
<pre class="src src-python"><code><span class="org-keyword">from</span> multiprocessing <span class="org-keyword">import</span> Process, Queue


<span class="org-keyword">def</span> <span class="org-function-name">merge</span>(a, b):
    <span class="org-variable-name">r</span> <span class="org-operator">=</span> []
    <span class="org-keyword">while</span> a <span class="org-keyword">and</span> b:
        r.append(a.pop(0) <span class="org-keyword">if</span> a[0] <span class="org-operator">&lt;</span> b[0] <span class="org-keyword">else</span> b.pop(0))
    <span class="org-keyword">return</span> r <span class="org-operator">+</span> a <span class="org-operator">+</span> b


<span class="org-keyword">def</span> <span class="org-function-name">sort</span>(a):
    <span class="org-variable-name">mid</span> <span class="org-operator">=</span> <span class="org-builtin">len</span>(a) <span class="org-operator">//</span> 2
    <span class="org-keyword">return</span> a <span class="org-keyword">if</span> <span class="org-builtin">len</span>(a) <span class="org-operator">&lt;=</span> 1 <span class="org-keyword">else</span> merge(sort(a[:mid]), sort(a[mid:]))


<span class="org-keyword">def</span> <span class="org-function-name">parallel_sort</span>(a, q):
    q.put(sort(a))


<span class="org-keyword">if</span> <span class="org-builtin">__name__</span> <span class="org-operator">==</span> <span class="org-string">"__main__"</span>:
    <span class="org-variable-name">arr</span> <span class="org-operator">=</span> [8, 3, 7, 4, 9, 2, 6, 5]
    <span class="org-variable-name">mid</span> <span class="org-operator">=</span> <span class="org-builtin">len</span>(arr) <span class="org-operator">//</span> 2
    <span class="org-variable-name">q1</span>, <span class="org-variable-name">q2</span> <span class="org-operator">=</span> Queue(), Queue()

    <span class="org-variable-name">p1</span> <span class="org-operator">=</span> Process(target<span class="org-operator">=</span>parallel_sort, args<span class="org-operator">=</span>(arr[:mid], q1))
    <span class="org-variable-name">p2</span> <span class="org-operator">=</span> Process(target<span class="org-operator">=</span>parallel_sort, args<span class="org-operator">=</span>(arr[mid:], q2))

    p1.start()
    p2.start()

    <span class="org-variable-name">sorted_arr</span> <span class="org-operator">=</span> merge(q1.get(), q2.get())

    p1.join()
    p2.join()

    <span class="org-builtin">print</span>(<span class="org-string">"Unsorted:"</span>, arr)
    <span class="org-builtin">print</span>(<span class="org-string">"Sorted:"</span>, sorted_arr)
</code></pre>
</div>
</div>
</div>
