dpp/DPP-Practicals.org
* Practical 8 - Load Balancing Simulation
#+begin_src python :tangle load.py
import random

tasks = [random.randint(1, 10) for _ in range(10)]
print(f"Tasks {tasks}")

nodes = [0] * 3


for i, t in enumerate(tasks):
    nodes[i % len(nodes)] += t

print(f"Static load {nodes}")

nodes = [0] * 3

for t in tasks:
    nodes[nodes.index(min(nodes))] += t

print(f"Dynamic load {nodes}")
#+end_src

#+RESULTS:
: Static Load: [21, 19, 9]
: Dynamic Load: [17, 16, 16]

* Practical 9 - Fault Tolerance Mechanism
#+begin_src python :tangle fault.py
import random

checkpoint = 0

try:
    with open("log.txt", "r") as f:
        checkpoint = int(f.read())
except FileNotFoundError:
    pass

print(f"Starting step {checkpoint}")

try:
    for i in range(checkpoint + 1, 11):
        print(f"Step {i}")

        with open("log.txt", "w") as f:
            f.write(str(i))

        if random.random() < 0.3:
            raise Exception("Crash")
except:
    print("A failiure as occured...Restart")
#+end_src

#+RESULTS:
: Starting from step: 10

* Practical 10 - MapReduce Word Count
#+begin_src python :tangle mapreduce.py
from pyspark import SparkContext


def local_wc():
    t = open("input.txt").read().lower().split()
    print({w: t.count(w) for w in set(t)})


def spark():
    sc = SparkContext("local[*]", "WC")
    print(
        sc.textFile("input.txt")
        .flatMap(lambda x: x.split())
        .map(lambda x: (x.lower(), 1))
        .reduceByKey(lambda a, b: a + b)
        .collect()
    )


local_wc() if input("Choose 1:Local or 2: PySpark") == "1" else spark()
#+end_src
