dpp/DPP-Practicals.html
<div id="outline-container-org2d48bf6" class="outline-2">
<h2 id="org2d48bf6"><span class="section-number-2">8.</span> Practical 8 - Load Balancing Simulation</h2>
<div class="outline-text-2" id="text-8">
<div class="org-src-container">
<pre class="src src-python"><code><span class="org-keyword">import</span> random

<span class="org-variable-name">tasks</span> <span class="org-operator">=</span> [random.randint(1, 10) <span class="org-keyword">for</span> _ <span class="org-keyword">in</span> <span class="org-builtin">range</span>(10)]
<span class="org-builtin">print</span>(f<span class="org-string">"Tasks </span>{tasks}<span class="org-string">"</span>)

<span class="org-variable-name">nodes</span> <span class="org-operator">=</span> [0] <span class="org-operator">*</span> 3


<span class="org-keyword">for</span> i, t <span class="org-keyword">in</span> <span class="org-builtin">enumerate</span>(tasks):
    <span class="org-variable-name">nodes</span>[i <span class="org-operator">%</span> <span class="org-builtin">len</span>(nodes)] <span class="org-operator">+=</span> t

<span class="org-builtin">print</span>(f<span class="org-string">"Static load </span>{nodes}<span class="org-string">"</span>)

<span class="org-variable-name">nodes</span> <span class="org-operator">=</span> [0] <span class="org-operator">*</span> 3

<span class="org-keyword">for</span> t <span class="org-keyword">in</span> tasks:
    <span class="org-variable-name">nodes</span>[nodes.index(<span class="org-builtin">min</span>(nodes))] <span class="org-operator">+=</span> t

<span class="org-builtin">print</span>(f<span class="org-string">"Dynamic load </span>{nodes}<span class="org-string">"</span>)
</code></pre>
</div>

<pre class="example">
Static Load: [21, 19, 9]
Dynamic Load: [17, 16, 16]
</pre>
</div>
</div>
<div id="outline-container-orga04697a" class="outline-2">
<h2 id="orga04697a"><span class="section-number-2">9.</span> Practical 9 - Fault Tolerance Mechanism</h2>
<div class="outline-text-2" id="text-9">
<div class="org-src-container">
<pre class="src src-python"><code><span class="org-keyword">import</span> random

<span class="org-variable-name">checkpoint</span> <span class="org-operator">=</span> 0

<span class="org-keyword">try</span>:
    <span class="org-keyword">with</span> <span class="org-builtin">open</span>(<span class="org-string">"log.txt"</span>, <span class="org-string">"r"</span>) <span class="org-keyword">as</span> f:
        <span class="org-variable-name">checkpoint</span> <span class="org-operator">=</span> <span class="org-builtin">int</span>(f.read())
<span class="org-keyword">except</span> <span class="org-type">FileNotFoundError</span>:
    <span class="org-keyword">pass</span>

<span class="org-builtin">print</span>(f<span class="org-string">"Starting step </span>{checkpoint}<span class="org-string">"</span>)

<span class="org-keyword">try</span>:
    <span class="org-keyword">for</span> i <span class="org-keyword">in</span> <span class="org-builtin">range</span>(checkpoint <span class="org-operator">+</span> 1, 11):
        <span class="org-builtin">print</span>(f<span class="org-string">"Step </span>{i}<span class="org-string">"</span>)

        <span class="org-keyword">with</span> <span class="org-builtin">open</span>(<span class="org-string">"log.txt"</span>, <span class="org-string">"w"</span>) <span class="org-keyword">as</span> f:
            f.write(<span class="org-builtin">str</span>(i))

        <span class="org-keyword">if</span> random.random() <span class="org-operator">&lt;</span> 0.3:
            <span class="org-keyword">raise</span> <span class="org-type">Exception</span>(<span class="org-string">"Crash"</span>)
<span class="org-keyword">except</span>:
    <span class="org-builtin">print</span>(<span class="org-string">"A failiure as occured...Restart"</span>)
</code></pre>
</div>

<pre class="example">
Starting from step: 10
</pre>
</div>
</div>
<div id="outline-container-orgaf893b2" class="outline-2">
<h2 id="orgaf893b2"><span class="section-number-2">10.</span> Practical 10 - MapReduce Word Count</h2>
<div class="outline-text-2" id="text-10">
<div class="org-src-container">
<pre class="src src-python"><code><span class="org-keyword">from</span> pyspark <span class="org-keyword">import</span> SparkContext


<span class="org-keyword">def</span> <span class="org-function-name">local_wc</span>():
    <span class="org-variable-name">t</span> <span class="org-operator">=</span> <span class="org-builtin">open</span>(<span class="org-string">"input.txt"</span>).read().lower().split()
    <span class="org-builtin">print</span>({w: t.count(w) <span class="org-keyword">for</span> w <span class="org-keyword">in</span> <span class="org-builtin">set</span>(t)})


<span class="org-keyword">def</span> <span class="org-function-name">spark</span>():
    <span class="org-variable-name">sc</span> <span class="org-operator">=</span> SparkContext(<span class="org-string">"local[*]"</span>, <span class="org-string">"WC"</span>)
    <span class="org-builtin">print</span>(
        sc.textFile(<span class="org-string">"input.txt"</span>)
        .flatMap(<span class="org-keyword">lambda</span> x: x.split())
        .<span class="org-builtin">map</span>(<span class="org-keyword">lambda</span> x: (x.lower(), 1))
        .reduceByKey(<span class="org-keyword">lambda</span> a, b: a <span class="org-operator">+</span> b)
        .collect()
    )


local_wc() <span class="org-keyword">if</span> <span class="org-builtin">input</span>(<span class="org-string">"Choose 1:Local or 2: PySpark"</span>) <span class="org-operator">==</span> <span class="org-string">"1"</span> <span class="org-keyword">else</span> spark()
</code></pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2026-05-20 Wed 01:37</p>
</div>
</body>
</html>
